In [1]:
%matplotlib widget
from sqlalchemy import create_engine
from config import user, password
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/SQL Challenge') 
   
connection = engine.connect()

In [3]:
#Employee Data Read
emp_data = pd.read_sql("select * from employees", connection)
emp_data.head(15)

    emp_no emp_title_id  birth_date  first_name   last_name sex   hire_date
0   473302        s0001  1953-07-25    Hideyuki    Zallocco   M  1990-04-28
1   475053        e0002  1954-11-18       Byong   Delgrande   F  1991-09-07
2    57444        e0002  1958-01-30       Berry        Babb   F  1992-03-21
3   421786        s0001  1957-09-28       Xiong    Verhoeff   M  1987-11-26
4   282238        e0003  1952-10-28  Abdelkader     Baumann   F  1991-01-18
5   263976        e0003  1959-10-30        Eran    Cusworth   M  1986-11-14
6   273487        s0001  1957-04-14   Christoph     Parfitt   M  1991-06-28
7   461591        s0002  1964-11-17      Xudong    Samarati   M  1985-11-13
8   477657        e0002  1962-12-18      Lihong   Magliocco   M  1993-10-23
9   219881        s0002  1956-04-24   Kwangyoen       Speek   F  1993-02-14
10   29920        e0002  1961-12-31     Shuichi       Tyugu   F  1995-01-17
11  208153        e0003  1961-10-25     Abdulah        Lunn   M  1989-04-08
12   13616        e0003  1961-08-30       Perry       Lorho   F  1991-08-03
13  246449        s0001  1958-03-23       Subbu  Bultermann   F  1988-03-25
14   21529        e0002  1959-05-19       Bojan    Zallocco   M  1986-10-14

In [4]:
#Salary Data Read
sal_data = pd.read_sql("select * from salaries", connection)
sal_data.head(15)

    emp_no  salary
0    10001   60117
1    10002   65828
2    10003   40006
3    10004   40054
4    10005   78228
5    10006   40000
6    10007   56724
7    10008   46671
8    10009   60929
9    10010   72488
10   10011   42365
11   10012   40000
12   10013   40000
13   10014   46168
14   10015   40000

In [5]:
#Join both data
emp_sal_join = pd.read_sql('select employees.emp_no, salaries.salary from employees inner join salaries on employees.emp_no = salaries.emp_no order by salaries.salary desc',
                          connection)
emp_sal_join.head(15)

    emp_no  salary
0   205000  129492
1    44188  127238
2   444756  127041
3   458302  126703
4    37558  125469
5   296857  124357
6    20004  123749
7   109334  123668
8   474456  123477
9   474684  122726
10  267005  122423
11  238117  121617
12   48571  121468
13  406747  121393
14  258777  121070

In [6]:
#Basic describe for salary

In [9]:
#2. Create a histogram to visualize the most common salary ranges for employees.
fig,ax = plt.subplots(figsize=(8,6))
plt.hist(emp_sal_join["salary"])
plt.xlabel("Salary ($)")
plt.ylabel("Count of Employees")
plt.title("The most common salary ranges for employees")
plt.show()

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

In [11]:
#Title Data
title_data = pd.read_sql("select * from titles", connection)
title_data.head(15)

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [16]:
new_emp_data = emp_data.rename(columns={"emp_title_id":"title_id"})
new_emp_data.head()

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [19]:
#Merge Employee and title data
merge_data = pd.merge(new_emp_data, title_data, on = "title_id", how = "inner")
merge_data.head()

   emp_no title_id  birth_date  first_name   last_name sex   hire_date  title
0  473302    s0001  1953-07-25    Hideyuki    Zallocco   M  1990-04-28  Staff
1  421786    s0001  1957-09-28       Xiong    Verhoeff   M  1987-11-26  Staff
2  273487    s0001  1957-04-14   Christoph     Parfitt   M  1991-06-28  Staff
3  246449    s0001  1958-03-23       Subbu  Bultermann   F  1988-03-25  Staff
4   48085    s0001  1964-01-19  Venkatesan        Gilg   M  1993-06-28  Staff

In [20]:
#merge "Merge_data" with sal data
merge_data2 = pd.merge(merge_data, sal_data, on = "emp_no", how = "inner")
merge_data2.head()

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,title,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,Staff,40000
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,Staff,40000
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,Staff,56087
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,Staff,87084
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,Staff,63016

In [29]:
#Needed part
tit_sal_only = merge_data2[["title","salary"]]
tit_sal_only.head(10)

#Average
avg_sal = tit_sal_only.groupby(["title"])
avg_sal.mean()
avg_sal.reset_index(level=non)

                          salary
title
Assistant Engineer  48564.434447
Engineer            48535.336511
Manager             51531.041667
Senior Engineer     48506.799871
Senior Staff        58550.172704
Staff               58465.382850
Technique Leader    48582.896092

In [13]:
#Get the salary for each title
emp_tit_sal =  pd.read_sql("Select t.title, s.salary from employees e, salaries s, titles t \
where e.emp_no = s.emp_no and t.title_id = e.emp_title_id", connection)
emp_tit_sal.head()

              title  salary
0          Engineer   48973
1   Senior Engineer   40000
2  Technique Leader   43548
3             Staff   63377
4   Senior Engineer   40000

In [ ]:
#3. Create a bar chart of average salary by title.